[
  {
    "name": "Kamerlengo fortress",
    "picture": "https://media-cdn.tripadvisor.com/media/photo-s/0d/65/11/48/fortress-kamerlengo.jpg",
    "description_text": "The Kamerlengo Fortress, raised on the southwestern angle of the islet on which there is the historic center of Trogir, was built from 1420 to 1437, immediately after the Venetian conquering of Trogir. It was built in the shape of an irregular trapezoid with four towers at its angles, of which the oldest and the largest was built earlier, in the 14th century.",
    "view_more_link": "https://www.visittrogir.hr/fortresses",
    "category": "historicalsite"
  },
  {
    "name": "St. Lawrence's Cathedral",
    "picture": "http://www.all-free-photos.com/images/croatie/PI31876-hr.jpg",
    "description_text": "The Cathedral of St. Lawrence (of St. John of Trogir) takes the main place among the Trogir churches. The church area, in which believers gathered from the Middle Ages, is also a building where slogans from Romanticism, Gothics, Renaissance and Baroque mingle and which houses valuable works of art. While in antiquity the cemetery was in the part of the city that is on land, in the Middle Ages burials took place in the Cathedral and in the majority of the churches in the city and its surroundings.",
    "view_more_link": "https://www.visittrogir.hr/st-lawrence-cathedral",
    "category": "historicalsite"
  },
  {
    "name": "The Cipicco palaces",
    "picture": "https://media-cdn.tripadvisor.com/media/photo-s/0b/fc/65/14/palace-cipiko.jpg",
    "description_text": "The two Cipicco Palaces, the large and the small one, were created by connecting Romanesque buildings. In the front of the large palace, there is a Gothic triphora, a work of art of Andrea Alessi, and the doors quarried by Ivan Duknović. The Southern portal was made by Niccolò Fiorentino.",
    "view_more_link": "https://www.visittrogir.hr/palaces",
    "category": "historicalsite"
  },
  {
    "name": "The communal Palace - town hall",
    "picture": "https://previews.123rf.com/images/borisb17/borisb171803/borisb17180300138/98059086-the-city-hall-the-rector-s-palace-on-central-square-in-trogir-croatia.jpg",
    "description_text": "The Communal Palace – the Town Hall is mentioned in the 13th century; today’s appearance can be attributed to the renovation in the 19th century when the coats of arms of the noble families of the town were installed as well as other spolia that bring back its Renaissance look.  The very internal courtyard has Gothic stylistic features with a stairway constructed by Matej Gojković. A duke lived in the palace and ruled the town from there. In the Modern Age, a part of the first floor served for the needs of a theatre. ",
    "view_more_link": "https://www.visittrogir.hr/palaces",
    "category": "historicalsite"
  },
  {
    "name": "St. Dominic's church and monastery",
    "picture": "https://smn.hr/images/svetista/sv-dominik.jpg",
    "description_text": "The St. Dominic Monastery was established in mid-13th century. At the beginning of the 14th century, a single-nave church was built with a Gothic bell tower. It is interesting that the wooden ceiling has beams placed in the form of a bottom of a ship. The main entrance with a lunette and a relief presenting the Mother of God in the middle, the beatified Augustin Kažotić and St. Mary Magdalene, a work of art of Nicola Dente, is in the Western church wall.",
    "view_more_link": "https://www.visittrogir.hr/churches-and-monasteries",
    "category": "historicalsite"
  },
  {
    "name": "St. Peter's church",
    "picture": "https://smn.hr/images/galerije/zupe/trogir-sv-lovre/sv.petar.JPG",
    "description_text": "The St. Peter’s church used to be within the Benedictine monastery intended for noble daughters. The tradition says that is was established by the wife of Bela IV in the 13th century. From the monastery that was used until the 18th century, there is a yard left with a crown of the well with the coat of arms of the Marković family.",
    "view_more_link": "https://www.visittrogir.hr/churches-and-monasteries",
    "category": "historicalsite"
  },
  {
    "name": "St. Mark tower",
    "picture": "http://www.topdestinacije.hr/upload_data/ckeditor/26%20TROGIR/00390.MTS_snapshot_00.07_[2012.04.17_16.53.56].jpg",
    "description_text": "The St. Mark Tower was built in the 15th century and is situated in the northeastern part of the islet on which there is the historic center of Trogir. It was built in the shape of a circle, with walls of a bent surface; its outer walls were originally entirely washed by the sea.",
    "view_more_link": "https://www.visittrogir.hr/fortresses",
    "category": "historicalsite"
  },
  {
    "name": "Northern City Gate",
    "picture": "http://www.journal.hr/wp-content/uploads/2015/08/trogir-kopnena-vrata-post1.jpg",
    "description_text": "The Northern City Gate is a new city gate built in the 17th century, at the time of the Cretan War. It got its today’s look in 1763; the year is quarried on the very gate. The gate also shows the openings for chains with which one lifted and lowered the wooden, movable part of a former bridge. The gate also shows a hook on which there was a coat of arms of the provider (ruler) Antonio Bernardo, nowadays located in the stone exhibition of the Museum of the City of Trogir.",
    "view_more_link": "https://www.visittrogir.hr/more-landmarks",
    "category": "historicalsite"
  },
  {
    "name": "Master Radovan's Portal",
    "picture": "https://www.min-kulture.hr/userdocsimages/izabrane%20teme/rad%205.jpg",
    "description_text": "The Croatian architect Master sculptor Radovan, the most important sculptor of Croatian medieval art, worked on the cathedral’s gateway (main west portal of St. Lawrence cathedral) early in its construction. Most of the portal was carved by the master himself.  Finished and signed in 1240, it is a monumental and unique work of this great Croatian artist. He signed his name on the portal in an inscription that runs under the lunette and reliefs of the Annunciation, where he is celebrated as “the best of all in this art“ (cunctis hac arte preclarum)",
    "view_more_link": "https://split-excursions.com/attractions/radovans-portal/",
    "category": "historicalsite"
  },
  {
    "name": "Riva",
    "picture": "https://www.visit-croatia.co.uk/wp-content/uploads/2017/12/trogir-riva.jpg",
    "description_text": "A great spot to for a stroll, a cup of coffee, catching som rays and enjoying like the locals do.",
    "view_more_link": "https://foursquare.com/v/trogirska-riva/4c25bf4ff7ced13a4f28256d",
    "category": "historicalsite"
  },
  {
    "name": "Trogir City Museum",
    "picture": "https://croatiareviews.com/media/reviews/photos/original/cc/d5/13/518-trogir-s-city-museum-45-1437838537.jpg",
    "description_text": "This towns \"pearl\" is located in the palace Garagnin – Fanfogna, with characteristics of Romanesque and Baroque styles. The museum’s collections show the political, cultural and artistic development of the town from its foundation till the 20th century.",
    "view_more_link": "https://croatiareviews.com/culture-and-heritage/trogir-city-museum",
    "category": "museum"
  },
  {
    "name": "Kairos collection",
    "picture": "https://www.total-croatia-news.com/images/news/Trogir3.png",
    "description_text": "The Church of St. Nicholas was created on the foundations of older smaller churches and the southern gate of the antique town, with the stylistic features ranging from Romanesque period to Baroque. Its courtyard is turned into a small stone exhibition from which one enters into the Kairos art collection, whose most valuable exhibit is the relief with the figure of Kairos, a deity of the happy moment created in the period between the 4th and 3rd century B.C. In the exhibition, there are stone fragments found during archaeological research in the church itself and heritage in paintings, silver, church vestments, manuscripts etc.",
    "view_more_link": "https://www.visittrogir.hr/kairos-collection",
    "category": "museum"
  },
  {
    "name": "Pinacotheque",
    "picture": "http://www.portal-trogir.com/tolteam/upload/FCKupload/image/blaz%20jurjev%20trogiranin.jpg",
    "description_text": "Pinacotheque is an exhibition of sacral objects from churches of Trogir and Čiovo. It consists of old manuscripts and various artworks from Dalmatian and Italian artists, the most famous of which is Blaž Jurjev Trogiranin, also known as Dalmatian Giotto.",
    "view_more_link": "https://www.visittrogir.hr/more-landmarks",
    "category": "museum"
  },
  {
    "name": "Cata Dujšin Ribar Gallery",
    "picture": "https://www.galum.hr/site/assets/files/1505/autportret.1000x0.jpg",
    "description_text": "Within Trogir City museum there is a gallery of Trogir born famous Croatian artist Cata Dujšin Ribar.",
    "view_more_link": "https://croatiareviews.com/culture-and-heritage/trogir-city-museum",
    "category": "museum"
  },
  {
    "name": "Restaurant Riva",
    "picture": "https://www.klikcup.com/images/objects/964/riva-terrace.jpg",
    "description_text": "Local cuisine, Seafood, Mediterranean, European, Croatian",
    "view_more_link": "http://en.restaurant-riva.net/",
    "category": "restaurant"
  },
  {
    "name": "Restaurant Mirkec",
    "picture": "http://www.portal-trogir.com/tolteam/upload/FCKupload/mirkec.png",
    "description_text": "Italian, Pizza, Mediterranean, European, Croatian",
    "view_more_link": "https://www.tripadvisor.com/Restaurant_Review-g303838-d2096167-Reviews-Pizzeria_Mirkec-Trogir_Split_Dalmatia_County_Dalmatia.html",
    "category": "restaurant"
  },
  {
    "name": "Bubalus Burger Bar",
    "picture": "https://www.klikcup.com/images/objects/1150/bubalus-burger-entry.jpg",
    "description_text": "Bar, American, Vegetarian Friendly",
    "view_more_link": "https://www.facebook.com/BubalusBurgerBar/",
    "category": "restaurant"
  },
  {
    "name": "Restaurant Alka",
    "picture": "http://restaurant-alka.hr/uploads/gallery/1/s_595380bf47daa08.jpg",
    "description_text": "Local cuisine, European, Croatian, Central European, International",
    "view_more_link": "http://restaurant-alka.hr/index.php?lang=EN",
    "category": "restaurant"
  },
  {
    "name": "Restaurant Kamerlengo",
    "picture": "https://www.dalmatia.hr/media/k2/items/cache/5cf8d68adfbc926b964baa0e9f5b8056_XL.jpg",
    "description_text": "Local cuisine, Seafood, Mediterranean, Barbecue, European, Croatian",
    "view_more_link": "http://www.kamerlengo.hr",
    "category": "restaurant"
  },
  {
    "name": "Calebotta",
    "picture": "https://www.klikcup.com/images/objects/954/calebotta-entry.jpg",
    "description_text": "Local cuisine, International, Seafood, Croatian, Mediterranean",
    "view_more_link": "http://calebotta.com/?lang=en",
    "category": "restaurant"
  },
  {
    "name": "Restaurant Monika",
    "picture": "https://media-cdn.tripadvisor.com/media/photo-s/10/35/9d/89/photo0jpg.jpg",
    "description_text": "Seafood, Mediterranean, European, Croatian",
    "view_more_link": "https://hotel-monika.com.hr/en",
    "category": "restaurant"
  },
  {
    "name": "Restaurant Bocel",
    "picture": "https://media-cdn.tripadvisor.com/media/photo-s/0c/1b/02/7c/restaurant-bocel-marina.jpg",
    "description_text": "Seafood, Mediterranean, Croatian, European",
    "view_more_link": "http://www.restaurantbocel.com/en/",
    "category": "restaurant"
  },
  {
    "name": "Bifora Heritage Hotel",
    "picture": "https://d2g6qre7voj6kv.cloudfront.net/sales/45190/36f3aea1_a788_46f8_b440_91f04943901f.jpg?auto=format,compress",
    "description_text": "Opened in 2016 and featuring a seafront location on Čiovo Island, Bifora Heritage Hotel is just 350 m from Trogir Old Town. The hotel offers an on-site restaurant and a bar with a terrace that boasts views of the nearby marina and Trogir Old Town. Free WiFi is provided in all areas.",
    "view_more_link": "https://www.biforahotel.com",
    "category": "accomodation"
  },
  {
    "name": "Heritage Hotel Pašike",
    "picture": "https://t-ec.bstatic.com/images/hotel/max1024x768/118/118177013.jpg",
    "description_text": "Offering free airport pick-up, Hotel Pasike is situated in the very centre of Trogir, amongst a labyrinth of peaceful and charming streets, free from the sounds of traffic. It was opened in 2004 after an extensive reconstruction project to an old Buble family house. It is decorated with 19th and early 20th century unique furniture. So when you stay in your room you can bask in the spirit of centuries past.",
    "view_more_link": "http://hotelpasike.com/en/",
    "category": "accomodation"
  },
  {
    "name": "Hotel Monika",
    "picture": "http://www.atlas-trogir.com/slike/monika/accommodation/3129/Monika-6.jpg",
    "description_text": "Situated in the heart of UNESCO-protected Trogir Old Town, Hotel Monika is surrounded by the unique narrow streets of the ancient city. An à-la-carte restaurant is located on site and offers various Mediterranean delicacies. All rooms offer elegant and functional, offering luxury furniture, air-conditioning and free Wi-FI.",
    "view_more_link": "https://hotel-monika.com.hr/en",
    "category": "accomodation"
  },
  {
    "name": "Aparthotel Bellevue",
    "picture": "https://media-cdn.tripadvisor.com/media/photo-s/05/3c/28/a1/aparthotel-bellevue.jpg",
    "description_text": "Overlooking the Old Town of Trogir and the surrounding islands, Aparthotel Bellevue Trogir is situated 100 m from the sea. It offers free WiFi and a continental breakfast. All units provide air conditioning, a satellite LCD TV, a safe and a private bathroom. Apartments also comprise a kitchenette and a dining area. Some units also feature a balcony.",
    "view_more_link": "http://bellevue.com.hr/?lang=en",
    "category": "accomodation"
  },
  {
    "name": "Hotel Concordia",
    "picture": "https://q-cf.bstatic.com/images/hotel/max1024x768/803/8036296.jpg",
    "description_text": "The only hotel situated on the promenade of the UNESCO-protected town of Trogir, Hotel Concordia is set between the Kamerlengo fortress and the St. Dominic Convent, close to many coffee bars and restaurants.",
    "view_more_link": "https://concordia-hotel.net",
    "category": "accomodation"
  },
  {
    "name": "Hotel Tragos",
    "picture": "https://s-ec.bstatic.com/images/hotel/max1024x768/213/2130956.jpg",
    "description_text": "Set in a 18th century Baroque palace, Hotel Tragos offers rooms with pine wood furniture and sunny colours. The building is in Trogir's historical centre, a UNESCO World Heritage Site. The Tragos is only 20 m away from the city square, the Pjaca and the famous St. Lawrence cathedral.",
    "view_more_link": "http://www.tragos.hr/en/",
    "category": "accomodation"
  },
  {
    "name": "XII Century Heritage Hotel",
    "picture": "https://images.trvl-media.com/hotels/16000000/15450000/15446700/15446652/025963da_z.jpg",
    "description_text": "Boasting a sun terrace and views of the sea, XII Century Heritage Hotel is set 100 m from St. Peter's Church in the UNESCO-protected Trogir. The hotel features free WiFi throughout the property, and a restaurant where guests can enjoy Mediterranean cuisine. Each unit at this hotel is air conditioned and equipped with a flat-screen TV while some units include a seating area to relax in. All rooms have a private bathroom fitted with a bath. For extra comfort, guests can find bath robes and slippers.",
    "view_more_link": "http://heritagehoteltrogir.com/",
    "category": "accomodation"
  },
  {
    "name": "Brown Beach House",
    "picture": "https://media-cdn.tripadvisor.com/media/photo-s/0c/bc/ee/1e/ss.jpg",
    "description_text": "Featuring a swimming pool with sun terrace set right next to the sea, Hotel Brown Beach House offers pet-friendly accommodation in Trogir. Guests can enjoy the on-site restaurant or have a drink at the poolside bar. Free WiFi and free private parking are available.",
    "view_more_link": "https://www.brownhotels.com",
    "category": "accomodation"
  },
  {
    "name": "Čiovo",
    "picture": "https://i.croatiaimages.com/places/165/dalmatia-ciovo-businci-croatia-1-720x480.jpg",
    "description_text": "Čiovo is an island connected by bridge to the island of Trogir and an extension to the mainland. The island has a widespread place to relax, have fun, swim and more. It has numerous pre-Romanesque and medieval churches and a rich Mediterranean vegetation. Firstly used in the Greek era for planting olive trees and vineyards. The island is divided into Miševac, Mastrinka, Arbanija, Žedno, Slatine (Split district), Okrug Gornji and Okrug Donji (Okrug district).",
    "view_more_link": "https://www.visittrogir.hr/ciovo-island",
    "category": "nearbyplace"
  },
  {
    "name": "Drvenik islands",
    "picture": "http://static.waypoint.hr/uploads/2015/10/sailing_destinations_in_croatia_drvenik_veli-2.jpg",
    "description_text": "Drvenik islands are still mainly untouched and have managed to keep their purity on its coast, vegetation, and habitats. Here you can capture the nature in its true sense – crystal clean water, sandy beaches, Mediterranean vegetation, domestic fruit trees, olive trees – truly untouched making it perfect to relax and enjoy your holiday",
    "view_more_link": "https://www.visittrogir.hr/drvenik-islands",
    "category": "nearbyplace"
  },
  {
    "name": "Šolta",
    "picture": "https://www.otoci.eu/wp-content/uploads/2018/03/Solta-13.jpg",
    "description_text": "Visit Šolta if you're near by - swap the perpetually crowded roads leading to cramped city beaches for a ferry ride, cool down on its deck and, in less than an hour, arrive at a destination with christal clear sea, numerous pebble beaches not busy with bathers, with realistic and affordable prices and where no one will bother you shouting \"Zimmer frei!\".",
    "view_more_link": "https://visitsolta.com/en/home",
    "category": "nearbyplace"
  },
  {
    "name": "Split",
    "picture": "https://s27412.pcdn.co/wp-content/uploads/2015/06/Split-Croatia_Silimon-Photojpg.jpg",
    "description_text": "The story of Split is already 17 centuries old, dating to the time the Roman Emperor Diocletian decided to build his Palace right on the peninsula near the great Roman city Salona, where he wanted to spend the last years of his life. During these 1700 years the Palace slowly turned into a city, which to this day lures with its rich tradition, glorious history and beauty of its natural and cultural heritage. ",
    "view_more_link": "https://visitsplit.com/en",
    "category": "nearbyplace"
  },
  {
    "name": "Šibenik",
    "picture": "https://www.discover-dalmatia.hr/files/Image/dalmacija/sibenik.jpg",
    "description_text": "Šibenik was mentioned for the first time on Christmas in 1066 in a document issued by the King Petar Krešimir IV, therefore also called the Krešimir town. It was founded by Croats over a thousand years ago, making it the oldest native Croatian town on the Adriatic. It started to develop out from the settlement at the foot of the St. Michael's Fortress on a steep cliff above the city. The city status was given in 1169.",
    "view_more_link": "https://www.sibenik-tourism.hr/en/",
    "category": "nearbyplace"
  }
]